Revit 2027 API
BoundaryConditions.CreateAreaBoundaryConditions Method
Overload List
Name | Description
CreateAreaBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new hosted area boundary conditions within the project.
CreateAreaBoundaryConditions(Document, ElementId, IList<CurveLoop>, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new custom area boundary conditions within the project.
Top
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace